Protocentral/healthypi-move-fw/app/drivers/sensor/max32664d/max32664d.c
	return 0;
}



static int m_i2c_write_cmd_4(const struct device *dev, uint8_t byte1, uint8_t byte2, uint8_t byte3, uint8_t byte4)
{
	const struct max32664_config *config = dev->config;
	uint8_t wr_buf[4];
	uint8_t rd_buf[1];

	wr_buf[0] = byte1;
	wr_buf[1] = byte2;
	wr_buf[2] = byte3;
	wr_buf[3] = byte4;

	gpio_pin_set_dt(&config->mfio_gpio, 0);
	k_sleep(K_USEC(300));

	i2c_write_dt(&config->i2c, wr_buf, sizeof(wr_buf));
	k_sleep(K_MSEC(MAX32664_DEFAULT_CMD_DELAY));
	i2c_read_dt(&config->i2c, rd_buf, 1);
	k_sleep(K_MSEC(MAX32664_DEFAULT_CMD_DELAY));

	gpio_pin_set_dt(&config->mfio_gpio, 1);

	LOG_DBG("CMD: %x %x %x %x | RSP: %x", wr_buf[0], wr_buf[1], wr_buf[2], wr_buf[3], rd_buf[0]);

	k_sleep(K_MSEC(45));

	return 0;
}

static int m_i2c_write_cmd_5(const struct device *dev, uint8_t byte1, uint8_t byte2, uint8_t byte3, uint8_t byte4, uint8_t byte5)
{
	const struct max32664_config *config = dev->config;
	uint8_t wr_buf[5];
	uint8_t rd_buf[1];

	wr_buf[0] = byte1;
	wr_buf[1] = byte2;
	wr_buf[2] = byte3;
	wr_buf[3] = byte4;
	wr_buf[4] = byte5;

	gpio_pin_set_dt(&config->mfio_gpio, 0);
	k_sleep(K_USEC(300));

	i2c_write_dt(&config->i2c, wr_buf, sizeof(wr_buf));
	k_sleep(K_MSEC(MAX32664_DEFAULT_CMD_DELAY));
	i2c_read_dt(&config->i2c, rd_buf, 1);
	k_sleep(K_MSEC(MAX32664_DEFAULT_CMD_DELAY));

	gpio_pin_set_dt(&config->mfio_gpio, 1);

	LOG_DBG("CMD: %x %x %x %x %x | RSP: %x", wr_buf[0], wr_buf[1], wr_buf[2], wr_buf[3], wr_buf[4], rd_buf[0]);

	k_sleep(K_MSEC(45));

	return 0;
}

int max32664d_get_fifo_count(const struct device *dev)
{
	const struct max32664_config *config = dev->config;
	uint8_t rd_buf[2] = {0x00, 0x00};
	uint8_t wr_buf[2] = {0x12, 0x00};

	uint8_t fifo_count;
	gpio_pin_set_dt(&config->mfio_gpio, 0);
	k_sleep(K_USEC(300));

	i2c_write_dt(&config->i2c, wr_buf, sizeof(wr_buf));
	i2c_read_dt(&config->i2c, rd_buf, sizeof(rd_buf));

	gpio_pin_set_dt(&config->mfio_gpio, 1);

	fifo_count = rd_buf[1];
	return (int)fifo_count;
}

static int m_i2c_write_cmd_3(const struct device *dev, uint8_t byte1, uint8_t byte2, uint8_t byte3, uint16_t cmd_delay)
{
	const struct max32664_config *config = dev->config;
	uint8_t wr_buf[3];

	uint8_t rd_buf[1] = {0x00};

	wr_buf[0] = byte1;
	wr_buf[1] = byte2;
	wr_buf[2] = byte3;

	gpio_pin_set_dt(&config->mfio_gpio, 0);
	k_sleep(K_USEC(300));

	i2c_write_dt(&config->i2c, wr_buf, sizeof(wr_buf));
	k_sleep(K_MSEC(cmd_delay));

	i2c_read_dt(&config->i2c, rd_buf, sizeof(rd_buf));
	k_sleep(K_USEC(300));

	gpio_pin_set_dt(&config->mfio_gpio, 1);

	LOG_DBG("CMD: %x %x %x | RSP: %x", wr_buf[0], wr_buf[1], wr_buf[2], rd_buf[0]);

	k_sleep(K_MSEC(10));

	return 0;
}

static int m_i2c_write_cmd_3_rsp_2(const struct device *dev, uint8_t byte1, uint8_t byte2, uint8_t byte3)
{
	const struct max32664_config *config = dev->config;
	uint8_t wr_buf[3];

	uint8_t rd_buf[2] = {0x00, 0x00};

	wr_buf[0] = byte1;
	wr_buf[1] = byte2;
	wr_buf[2] = byte3;

	gpio_pin_set_dt(&config->mfio_gpio, 0);
	k_sleep(K_USEC(300));
	i2c_write_dt(&config->i2c, wr_buf, sizeof(wr_buf));

	k_sleep(K_MSEC(MAX32664_DEFAULT_CMD_DELAY));

	// gpio_pin_set_dt(&config->mfio_gpio, 0);
	k_sleep(K_USEC(300));
	i2c_read_dt(&config->i2c, rd_buf, sizeof(rd_buf));
	k_sleep(K_MSEC(500));

	gpio_pin_set_dt(&config->mfio_gpio, 1);

	LOG_DBG("CMD: %x %x %x | RSP: %x %x", wr_buf[0], wr_buf[1], wr_buf[2], rd_buf[0], rd_buf[1]);

	k_sleep(K_MSEC(10));

	return 0;
}

static int m_i2c_write_cmd_3_rsp_3(const struct device *dev, uint8_t byte1, uint8_t byte2, uint8_t byte3, uint8_t *rsp)
{
	const struct max32664_config *config = dev->config;
	uint8_t wr_buf[3];

	uint8_t rd_buf[3] = {0x00, 0x00, 0x00};

	wr_buf[0] = byte1;
	wr_buf[1] = byte2;
	wr_buf[2] = byte3;

	gpio_pin_set_dt(&config->mfio_gpio, 0);
	k_sleep(K_USEC(300));
	i2c_write_dt(&config->i2c, wr_buf, sizeof(wr_buf));

	k_sleep(K_MSEC(MAX32664_DEFAULT_CMD_DELAY));

	// gpio_pin_set_dt(&config->mfio_gpio, 0);
	k_sleep(K_USEC(300));
	i2c_read_dt(&config->i2c, rd_buf, sizeof(rd_buf));
	k_sleep(K_MSEC(500));

	gpio_pin_set_dt(&config->mfio_gpio, 1);

	LOG_DBG("CMD: %x %x %x | RSP: %x %x %x ", wr_buf[0], wr_buf[1], wr_buf[2], rd_buf[0], rd_buf[1], rd_buf[2]);

	memcpy(rsp, rd_buf, 3);

	k_sleep(K_MSEC(10));

	return 0;
}

static int m_i2c_write(const struct device *dev, uint8_t *wr_buf, uint32_t wr_len)
{
	const struct max32664_config *config = dev->config;

	uint8_t rd_buf[1] = {0x00};

	gpio_pin_set_dt(&config->mfio_gpio, 0);
	k_sleep(K_USEC(300));
	i2c_write_dt(&config->i2c, wr_buf, wr_len);

	k_sleep(K_MSEC(MAX32664_DEFAULT_CMD_DELAY));

	k_sleep(K_USEC(300));
	i2c_read_dt(&config->i2c, rd_buf, sizeof(rd_buf));
	k_sleep(K_MSEC(MAX32664_DEFAULT_CMD_DELAY));

	gpio_pin_set_dt(&config->mfio_gpio, 1);

	LOG_DBG("Write %d bytes | RSP: %d", wr_len, rd_buf[0]);

	k_sleep(K_MSEC(45));

	return 0;
}

int max32664d_do_enter_app(const struct device *dev)
{
	const struct max32664_config *config = dev->config;

	LOG_DBG("Entering app mode");

	gpio_pin_configure_dt(&config->mfio_gpio, GPIO_OUTPUT);

	// Enter APPLICATION mode
	gpio_pin_set_dt(&config->mfio_gpio, 1);
	k_sleep(K_MSEC(10));

	gpio_pin_set_dt(&config->reset_gpio, 0);
	k_sleep(K_MSEC(10));

	gpio_pin_set_dt(&config->reset_gpio, 1);
	k_sleep(K_MSEC(1000));
	// End of APPLICATION mode

	gpio_pin_configure_dt(&config->mfio_gpio, GPIO_INPUT);

	m_read_op_mode(dev);

	uint8_t ver_buf[4] = {0};
	if (m_get_ver(dev, ver_buf) == 0)
	{
		LOG_INF("Hub version: %d.%d.%d", ver_buf[1], ver_buf[2], ver_buf[3]);
	}
	else
	{
		// LOG_INF("MAX32664D not Found");
		return -ENODEV;
	}

	max32664d_read_hub_status(dev);
	k_sleep(K_MSEC(200));
	max32664d_read_hub_status(dev);

	return 0;
}

static void bpt_time_to_byte_le(uint32_t time, uint8_t *byte_time)
{

	byte_time[0] = (time & 0x000000FF);
	byte_time[1] = (time & 0x0000FF00) >> 8;
	byte_time[2] = (time & 0x00FF0000) >> 16;
	byte_time[3] = (time & 0xFF000000) >> 24;

	// printk("Hex Time: %x %x %x %x\n", byte_time[0], byte_time[1], byte_time[2], byte_time[3]);
}

static int m_set_date_time(const struct device *dev, uint32_t date, uint32_t time)
{
	uint8_t wr_buf[DATE_TIME_VECTOR_SIZE] = {0x50, 0x04, 0x04, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

	LOG_DBG("MAX32664 Set date: %d", date);

