Protocentral/healthypi-move-fw/app/drivers/sensor/max32664d/max32664d.c
	uint8_t byte_date[4];
	bpt_time_to_byte_le(date, byte_date);

	wr_buf[3] = byte_date[0];
	wr_buf[4] = byte_date[1];
	wr_buf[5] = byte_date[2];
	wr_buf[6] = byte_date[3];

	LOG_DBG("MAX32664 Set time: %d", time);

	uint8_t byte_time[4];
	bpt_time_to_byte_le(time, byte_time);

	wr_buf[7] = byte_time[0];
	wr_buf[8] = byte_time[1];
	wr_buf[9] = byte_time[2];
	wr_buf[10] = byte_time[3];

	m_i2c_write(dev, wr_buf, sizeof(wr_buf));

	return 0;
}

static int m_set_bp_cal_values(const struct device *dev, uint32_t sys, uint32_t dia)
{
	uint8_t wr_buf[6] = {0x50, 0x04, 0x01, 0x00, 0x00, 0x00};

	wr_buf[3] = sys >> 16;
	wr_buf[4] = sys >> 8;
	wr_buf[5] = sys;

	m_i2c_write(dev, wr_buf, sizeof(wr_buf));

	// Set diastolic BP
	wr_buf[2] = 0x02;

	wr_buf[3] = dia >> 16;
	wr_buf[4] = dia >> 8;
	wr_buf[5] = dia;

	m_i2c_write(dev, wr_buf, sizeof(wr_buf));

	return 0;
}

static int m_set_spo2_coeffs(const struct device *dev, float a, float b, float c)
{
	uint8_t wr_buf[15] = {0x50, 0x04, 0x06, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

	int32_t a_int = (int32_t)(a * 100000);

	wr_buf[3] = (a_int & 0xff000000) >> 24;
	wr_buf[4] = (a_int & 0x00ff0000) >> 16;
	wr_buf[5] = (a_int & 0x0000ff00) >> 8;
	wr_buf[6] = (a_int & 0x000000ff);

	int32_t b_int = (int32_t)(b * 100000);

	wr_buf[7] = (b_int & 0xff000000) >> 24;
	wr_buf[8] = (b_int & 0x00ff0000) >> 16;
	wr_buf[9] = (b_int & 0x0000ff00) >> 8;
	wr_buf[10] = (b_int & 0x000000ff);

	int32_t c_int = (int32_t)(c * 100000);

	wr_buf[11] = (c_int & 0xff000000) >> 24;
	wr_buf[12] = (c_int & 0x00ff0000) >> 16;
	wr_buf[13] = (c_int & 0x0000ff00) >> 8;
	wr_buf[14] = (c_int & 0x000000ff);

	m_i2c_write(dev, wr_buf, sizeof(wr_buf));

	return 0;
}

static int max32664_set_mode_raw(const struct device *dev)
{
	LOG_INF("MAX32664 Entering RAW mode...");
	// Enter appl mode
	m_i2c_write_cmd_3(dev, 0x01, 0x00, 0x00, MAX32664_DEFAULT_CMD_DELAY);

	// Read raw sensor data
	m_i2c_write_cmd_3(dev, 0x10, 0x00, 0x01, MAX32664_DEFAULT_CMD_DELAY);

	// Set interrupt threshold
	m_i2c_write_cmd_3(dev, 0x10, 0x01, 0x02, MAX32664_DEFAULT_CMD_DELAY);

	// Enable AFE
	m_i2c_write_cmd_3(dev, 0x44, 0x03, 0x01, MAX32664_DEFAULT_CMD_DELAY);
	k_sleep(K_MSEC(600));

	// Enable BPT estimation mode
	m_i2c_write_cmd_3(dev, 0x52, 0x04, 0x02, MAX32664_DEFAULT_CMD_DELAY);
	k_sleep(K_MSEC(600));

	// Disable AGC
	m_i2c_write_cmd_3(dev, 0x52, 0x01, 0x00, MAX32664_DEFAULT_CMD_DELAY);

	// Set MAX30101 LED1 current
	m_i2c_write_cmd_4(dev, 0x40, 0x03, 0x0C, 0x1F);
	k_sleep(K_MSEC(200));

	// Set MAX30101 LED2 current
	m_i2c_write_cmd_4(dev, 0x40, 0x03, 0x0D, 0x1F);
	k_sleep(K_MSEC(200));

	return 0;
}

static int max32664_load_calib(const struct device *dev)
{
	LOG_DBG("Loading calibration vector...\n");

	struct max32664d_data *data = dev->data;

	// Load calib vector
	m_i2c_write(dev, data->calib_vector, sizeof(data->calib_vector));
	k_sleep(K_MSEC(100));

	return 0;
}

static int max32664_set_mode_bpt_est(const struct device *dev)
{
	LOG_DBG("MAX32664 Entering BPT estimation mode...");

	// Enter appl mode
	// m_i2c_write_cmd_3(dev, 0x01, 0x00, 0x00);

	// Load calib vector
	// m_i2c_write(dev, data->calib_vector, sizeof(data->calib_vector));
	m_i2c_write(dev, m_bpt_cal_vector, sizeof(m_bpt_cal_vector));

	// Set date and time
	m_set_date_time(dev, DEFAULT_DATE, DEFAULT_TIME);

	// Set SpO2 calibration coeffs (A, B, C)
	m_set_spo2_coeffs(dev, DEFAULT_SPO2_A, DEFAULT_SPO2_B, DEFAULT_SPO2_C);

	// Set output mode to algo + sensor data
	m_i2c_write_cmd_3(dev, 0x10, 0x00, 0x03, MAX32664_DEFAULT_CMD_DELAY);

	// Set interrupt threshold
	m_i2c_write_cmd_3(dev, 0x10, 0x01, 0x0F, MAX32664_DEFAULT_CMD_DELAY);

	// Enable AGC
	m_i2c_write_cmd_3(dev, 0x52, 0x00, 0x01, MAX32664_DEFAULT_CMD_DELAY);
	k_sleep(K_MSEC(200));

	// Enable AFE
	m_i2c_write_cmd_3(dev, 0x44, 0x03, 0x01, MAX32664_DEFAULT_CMD_DELAY);
	k_sleep(K_MSEC(200));

	// Enable BPT estimation mode
	m_i2c_write_cmd_3(dev, 0x52, 0x04, 0x02, MAX32664_DEFAULT_CMD_DELAY);
	k_sleep(K_MSEC(100));

	return 0;
}

static int max32664d_get_afe_sensor_id(const struct device *dev)
{
	uint8_t rsp[3] = {0x00, 0x00, 0x00};
	m_i2c_write_cmd_3_rsp_3(dev, 0x41, 0x03, 0xFF, rsp);

	LOG_DBG("AFE Sensor ID: %x %x %x", rsp[0], rsp[1], rsp[2]);

	return rsp[1];
}

static int max32664_set_mode_bpt_cal(const struct device *dev)
{
	LOG_DBG("MAX32664 Starting BPT calibration...");

	// Output mode sensor + algo data
	m_i2c_write_cmd_3(dev, 0x10, 0x00, 0x03, MAX32664_DEFAULT_CMD_DELAY);

	// Set interrupt threshold
	m_i2c_write_cmd_3(dev, 0x10, 0x01, 0x01, MAX32664_DEFAULT_CMD_DELAY);
	k_sleep(K_MSEC(400));

	// Enable AFE
	m_i2c_write_cmd_3(dev, 0x44, 0x03, 0x01, MAX32664_DEFAULT_CMD_DELAY);
	k_sleep(K_MSEC(100));

	// Enable BPT algorithm in calibration mode
	m_i2c_write_cmd_3(dev, 0x52, 0x04, 0x01, MAX32664_DEFAULT_CMD_DELAY);

	return 0;
}

static int max32664_stop_estimation(const struct device *dev)
{
	LOG_DBG("MAX32664 Stopping BPT estimation...");

	// Disable AFE
	m_i2c_write_cmd_3(dev, 0x44, 0x03, 0x00, MAX32664_DEFAULT_CMD_DELAY);
	k_sleep(K_MSEC(40));

	// Disable BPT estimation mode
	m_i2c_write_cmd_3(dev, 0x52, 0x04, 0x00, MAX32664_DEFAULT_CMD_DELAY);
	k_sleep(K_MSEC(20));

	// Disable AGC
	m_i2c_write_cmd_3(dev, 0x52, 0x00, 0x00, MAX32664_DEFAULT_CMD_DELAY);
	k_sleep(K_MSEC(20));

	return 0;
}

int max32664_get_sample_fifo(const struct device *dev)
{
	struct max32664d_data *data = dev->data;
	const struct max32664_config *config = dev->config;

	uint8_t wr_buf[2] = {0x12, 0x01};

	uint8_t hub_stat = max32664d_read_hub_status(dev);
	if (hub_stat & MAX32664D_HUB_STAT_DRDY_MASK)
	{
		int fifo_count = max32664d_get_fifo_count(dev);

		if (fifo_count > 0)
		{
			int sample_len = 12;
			// printk("F: %d | ", fifo_count);
			data->num_samples = fifo_count;

			if (data->op_mode == MAX32664D_OP_MODE_RAW)
			{
				sample_len = 12;
			}
			else if (data->op_mode == MAX32664D_OP_MODE_BPT)
			{
				sample_len = 23;
			}

			i2c_write_dt(&config->i2c, wr_buf, sizeof(wr_buf));
			k_sleep(K_USEC(300));
			i2c_read_dt(&config->i2c, buf, ((sample_len * fifo_count) + 1));

			for (int i = 0; i < fifo_count; i++)
			{
				uint32_t led_ir = (uint32_t)buf[(sample_len * i) + 1] << 16;
				led_ir |= (uint32_t)buf[(sample_len * i) + 2] << 8;
				led_ir |= (uint32_t)buf[(sample_len * i) + 3];

