Protocentral/healthypi-move-fw/app/drivers/sensor/max32664d/max32664d.c
				data->samples_led_ir[i] = led_ir;

				uint32_t led_red = (uint32_t)buf[(sample_len * i) + 4] << 16;
				led_red |= (uint32_t)buf[(sample_len * i) + 5] << 8;
				led_red |= (uint32_t)buf[(sample_len * i) + 6];

				data->samples_led_red[i] = led_red;

				// bytes 7,8,9, 10,11,12 are ignored

				if (data->op_mode == MAX32664D_OP_MODE_BPT)
				{
					data->bpt_status = buf[(sample_len * i) + 13];
					data->bpt_progress = buf[(sample_len * i) + 14];

					uint16_t bpt_hr = (uint16_t)buf[(sample_len * i) + 15] << 8;
					bpt_hr |= (uint16_t)buf[(sample_len * i) + 16];

					data->hr = (bpt_hr / 10);

					data->bpt_sys = buf[(sample_len * i) + 17];
					data->bpt_dia = buf[(sample_len * i) + 18];

					uint16_t bpt_spo2 = (uint16_t)buf[(sample_len * i) + 19] << 8;
					bpt_spo2 |= (uint16_t)buf[(sample_len * i) + 20];

					data->spo2 = (bpt_spo2 / 10);

					uint16_t spo2_r_val = (uint16_t)buf[(sample_len * i) + 21] << 8;
					spo2_r_val |= (uint16_t)buf[(sample_len * i) + 22];

					data->spo2_r_val = (spo2_r_val / 1000);
					data->hr_above_resting = buf[(sample_len * i) + 23];
				}
			}
		}
	}
	else
	{
		// printk("FIFO empty\n");
	}

	return 0;
}

static int max32664_sample_fetch(const struct device *dev,
								 enum sensor_channel chan)
{
	struct max32664d_data *data = dev->data;
	data->num_samples = 0;

	return max32664_get_sample_fifo(dev);
}

static int max32664_channel_get(const struct device *dev,
								enum sensor_channel chan,
								struct sensor_value *val)
{
	struct max32664d_data *data = dev->data;

	int fifo_chan;

	switch (chan)
	{
	/*case SENSOR_CHAN_PPG_RED:
		val->val1 = data->samples_led_red[0];
		break;
	case SENSOR_CHAN_PPG_IR:
		val->val1 = data->samples_led_ir[0];
		break;
	case SENSOR_CHAN_PPG_RED_2:
		val->val1 = data->samples_led_red[1];
		break;
	case SENSOR_CHAN_PPG_IR_2:
		val->val1 = data->samples_led_ir[1];
		break;
	case SENSOR_CHAN_PPG_RED_3:
		val->val1 = data->samples_led_red[2];
		break;
	case SENSOR_CHAN_PPG_IR_3:
		val->val1 = data->samples_led_ir[2];
		break;
	case SENSOR_CHAN_PPG_RED_4:
		val->val1 = data->samples_led_red[3];
		break;
	case SENSOR_CHAN_PPG_IR_4:
		val->val1 = data->samples_led_ir[3];
		break;
	case SENSOR_CHAN_PPG_RED_5:
		val->val1 = data->samples_led_red[4];
		break;
	case SENSOR_CHAN_PPG_IR_5:
		val->val1 = data->samples_led_ir[4];
		break;
	case SENSOR_CHAN_PPG_RED_6:
		val->val1 = data->samples_led_red[5];
		break;
	case SENSOR_CHAN_PPG_IR_6:
		val->val1 = data->samples_led_ir[5];
		break;
	case SENSOR_PPG_NUM_SAMPLES:
		val->val1 = data->num_samples;
		break;
	case SENSOR_CHAN_PPG_HR:
		val->val1 = data->hr;
		break;
	case SENSOR_CHAN_PPG_SPO2:
		val->val1 = data->spo2;
		break;
	case SENSOR_CHAN_PPG_SPO2_R_VAL:
		val->val1 = data->spo2_r_val;
		break;
	case SENSOR_CHAN_PPG_BPT_STATUS:
		val->val1 = data->bpt_status;
		break;
	case SENSOR_CHAN_PPG_BPT_PROGRESS:
		val->val1 = data->bpt_progress;
		break;
	case SENSOR_CHAN_PPG_BP_SYS:
		val->val1 = data->bpt_sys;
		break;
	case SENSOR_CHAN_PPG_BP_DIA:
		val->val1 = data->bpt_dia;
		break;
	case SENSOR_CHAN_PPG_HR_ABOVE_RESTING:
		val->v*/
	default:
		LOG_ERR("Unsupported sensor channel");
		return -ENOTSUP;
	}

	return 0;
}

static int max32664_attr_set(const struct device *dev,
							 enum sensor_channel chan,
							 enum sensor_attribute attr,
							 const struct sensor_value *val)
{
	struct max32664d_data *data = dev->data;
	switch (attr)
	{
	case MAX32664_ATTR_OP_MODE:
		if (val->val1 == MAX32664D_OP_MODE_RAW)
		{
			max32664_set_mode_raw(dev);
			data->op_mode = MAX32664D_OP_MODE_RAW;
		}
		else if (val->val1 == MAX32664D_OP_MODE_BPT)
		{
			max32664_set_mode_bpt_est(dev);
			data->op_mode = MAX32664D_OP_MODE_BPT;
		}
		else if (val->val1 == MAX32664D_OP_MODE_BPT_CAL_START)
		{
			max32664_set_mode_bpt_cal(dev);
			data->op_mode = MAX32664D_OP_MODE_BPT_CAL_START;
		}
		else if (val->val1 == MAX32664D_OP_MODE_BPT_CAL_GET_VECTOR)
		{
			data->op_mode = MAX32664D_OP_MODE_BPT_CAL_GET_VECTOR;
		}
		else
		{
			LOG_ERR("Unsupported sensor operation mode");
			return -ENOTSUP;
		}
		break;
	case MAX32664_ATTR_DATE_TIME:
		uint32_t m_date = (uint32_t)val->val1;
		uint32_t m_time = (uint32_t)val->val2;
		m_set_date_time(dev, m_date, m_time); // val1 = date, val2 = time
		break;
	case MAX32664_ATTR_BP_CAL:
		uint32_t m_sys = (uint32_t)val->val1;
		uint32_t m_dia = (uint32_t)val->val2;
		m_set_bp_cal_values(dev, m_sys, m_dia); // va1 = sys, val2 = dia
		break;
	case MAX32664_ATTR_LOAD_CALIB:
		max32664_load_calib(dev);
		break;
	case MAX32664_ATTR_STOP_EST:
		max32664_stop_estimation(dev);
		break;
	case MAX32664_ATTR_ENTER_BOOTLOADER:
		max32664_do_enter_bl(dev);
		break;
	default:
		LOG_ERR("Unsupported sensor attribute");
		return -ENOTSUP;
	}

	return 0;
}

static int max32664d_attr_get(const struct device *dev,
							  enum sensor_channel chan,
							  enum sensor_attribute attr,
							  struct sensor_value *val)
{
	struct max32664d_data *data = dev->data;

	switch (attr)
	{
	case MAX32664D_ATTR_SENSOR_ID:
		val->val1 = max32664d_get_afe_sensor_id(dev);
		break;
	}
}

static const struct sensor_driver_api max32664_driver_api = {
	.attr_set = max32664_attr_set,
	.attr_get = max32664d_attr_get,

	.sample_fetch = max32664_sample_fetch,
	.channel_get = max32664_channel_get,

#ifdef CONFIG_SENSOR_ASYNC_API
	.submit = max32664d_submit,
	.get_decoder = max32664_get_decoder,
#endif
};

static int max32664_chip_init(const struct device *dev)
{
	const struct max32664_config *config = dev->config;
	// struct max32664d_data *data = dev->data;

	if (!device_is_ready(config->i2c.bus))
	{
		LOG_ERR("Bus device is not ready");
		return -ENODEV;
	}

	gpio_pin_configure_dt(&config->reset_gpio, GPIO_OUTPUT);
	gpio_pin_configure_dt(&config->mfio_gpio, GPIO_OUTPUT);

	return max32664d_do_enter_app(dev);
}

#ifdef CONFIG_PM_DEVICE
static int max32664_pm_action(const struct device *dev,
							  enum pm_device_action action)
{
	int ret = 0;

	switch (action)
	{
	case PM_DEVICE_ACTION_RESUME:
		/* Re-initialize the chip */

		break;
	case PM_DEVICE_ACTION_SUSPEND:
		/* Put the chip into sleep mode */

		break;
	default:
		return -ENOTSUP;
	}

	return ret;
}
#endif /* CONFIG_PM_DEVICE */

/*
 * Main instantiation macro, which selects the correct bus-specific
 * instantiation macros for the instance.
 */
#define MAX32664_DEFINE(inst)                                       \
	static struct max32664d_data max32664_data_##inst;              \
	static const struct max32664_config max32664_config_##inst =    \
		{                                                           \
			.i2c = I2C_DT_SPEC_INST_GET(inst),                      \
			.reset_gpio = GPIO_DT_SPEC_INST_GET(inst, reset_gpios), \
			.mfio_gpio = GPIO_DT_SPEC_INST_GET(inst, mfio_gpios),   \
	};                                                              \
	PM_DEVICE_DT_INST_DEFINE(inst, max32664_pm_action);             \
	SENSOR_DEVICE_DT_INST_DEFINE(inst,                              \
								 max32664_chip_init,                \
								 PM_DEVICE_DT_INST_GET(inst),       \
								 &max32664_data_##inst,             \
								 &max32664_config_##inst,           \
								 POST_KERNEL,                       \
								 CONFIG_SENSOR_INIT_PRIORITY,       \
								 &max32664_driver_api)

DT_INST_FOREACH_STATUS_OKAY(MAX32664_DEFINE)
